In [6]:
import pandas as pd
#df = pd.read_csv('../data/scores.csv')
df = pd.read_csv('emp.csv')
df

   empno  ename  deptno   sal
0      1  smith      10  4000
1      2  allen      10  4500
2      3   ford      20  4300
3      4  grace      10  4200
4      5  scott      30  4100
5      6   king      20  4000

# 데이터 미리보기

## 가장 앞의 n행 보기
* 데이터프레임.head(n)
* 시리즈.head(n)
* n을 생략하면 5개의 행을 출력한다

In [2]:
df.head(3)

   empno  ename  deptno   sal
0      1  smith      10  4000
1      2  allen      10  4500
2      3   ford      20  4300

## 가장 뒤의 n행 보기
* 데이터프레임.tail(n)
* n을 생략하면 5개의 행을 출력한다

In [3]:
df.tail()

   empno  ename  deptno   sal
1      2  allen      10  4500
2      3   ford      20  4300
3      4  grace      10  4200
4      5  scott      30  4100
5      6   king      20  4000

## 랜덤 보기

### 랜덤 n개 데이터 보기
* 데이터프레임.sample(n)
* n을 생략하면 1개의 샘플을 출력한다.

In [4]:
df.sample()

   empno ename  deptno   sal
2      3  ford      20  4300

### 랜덤 샘플 비율로 보기
* 데이터프레임.sample(frac=0.2)
* 지정한 비율의 샘플을 출력한다

In [5]:
df.sample(frac=0.2) # -> 20%만 추출

   empno  ename  deptno   sal
0      1  smith      10  4000

## 높은 순/낮은순 보기

### 높은순 보기
* 데이터프레임.nlargest(갯수,컬럼명)
* 컬럼의 데이터가 숫자형일 때 사용할 수 있다.

In [8]:
# sal 높은 순으로 5개 보기
df.nlargest(5,'sal')

   empno  ename  deptno   sal
1      2  allen      10  4500
2      3   ford      20  4300
3      4  grace      10  4200
4      5  scott      30  4100
0      1  smith      10  4000

### 낮은순 보기
* 데이터프레임.nsmallest(갯수,컬럼명)
* 컬럼의 데이터가 숫자형일 때 사용할 수 있다.

In [9]:
# sal 낮은 순으로 5개 보기
df.nsmallest(5,'sal')

   empno  ename  deptno   sal
0      1  smith      10  4000
5      6   king      20  4000
4      5  scott      30  4100
3      4  grace      10  4200
2      3   ford      20  4300

# 데이터 요약 보기

## (행,열)의 크기 보기
* 데이터프레임.shape

In [11]:
df.shape

(6, 4)

## 데이터의 갯수 보기
* len(데이터프레임)

In [12]:
len(df)

6

## 컬럼명 보기
* 데이터프레임.columns
* 데이터프레임의 열 이름을 확인한다.

In [13]:
df.columns

Index(['empno', 'ename', 'deptno', 'sal'], dtype='object')

## 인덱스 보기
* 데이터프레임.index
* 데이터프레임의 인덱스를 확인한다.

In [14]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [15]:
df

   empno  ename  deptno   sal
0      1  smith      10  4000
1      2  allen      10  4500
2      3   ford      20  4300
3      4  grace      10  4200
4      5  scott      30  4100
5      6   king      20  4000

## 데이터의 자료형 보기
* 데이터프레임.dtypes
* 데이터프레임을 구성하는 값의 자료형을 확인한다.
* 판다스에서는 문자열의 데이터타입이 object이다.

In [17]:
df.dtypes

empno      int64
ename     object
deptno     int64
sal        int64
dtype: object

## 데이터프레임 정보 보기
* 데이터프레임.info()
* 데이터프레임의 총 샘플 갯수, 컬럼 수, 컬럼 별 정보 등을 확인한다.

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   empno   6 non-null      int64
 1   ename   6 non-null      object
 2   deptno  6 non-null      int64
 3   sal     6 non-null      int64
dtypes: int64(3), object(1)
memory usage: 320.0+ bytes

## 컬럼의 유니크한 데이터 뽑기
* 컬럼.unique()

In [21]:
df['deptno'].unique()

array([10, 20, 30], dtype=int64)

## 컬럼의 유니크한 값의 갯수 보기
* 컬럼.**value_counts()**

In [22]:
df['deptno'].value_counts()

10    3
20    2
30    1
Name: deptno, dtype: int64

## 요약통계 보기

In [23]:
df.describe()

          empno     deptno          sal
count  6.000000   6.000000     6.000000
mean   3.500000  16.666667  4183.333333
std    1.870829   8.164966   194.079022
min    1.000000  10.000000  4000.000000
25%    2.250000  10.000000  4025.000000
50%    3.500000  15.000000  4150.000000
75%    4.750000  20.000000  4275.000000
max    6.000000  30.000000  4500.000000

In [24]:
df['sal'].mean()

4183.333333333333